[
  {
    "slug": "the-times-pilot",
    "isProject": false,
    "projectHeadline": "the.times.pilot: Tailoring Your NY Times Digest",
    "description": "Seamlessly curate and receive the stories that matter to you with a custom news aggregator and subscriber-focused daily email service.",
    "landingToolList": [
      "Figma",
      "TypeScript",
      "React",
      "Next.js",
      "Storybook",
      "SCSS",
      "NoSQL",
      "Twilio SendGrid"
    ],
    "projectPage": {
      "headlineOne": "the.times.pilot",
      "headlineTwo": "Tailoring Your NY Times Digest",
      "role": "Concept, Design, Development",
      "tools": [
        "Figma",
        "TypeScript",
        "React",
        "Next.js",
        "Storybook",
        "SCSS",
        "Firebase NoSQL",
        "Node.js",
        "GCP Cloud Functions",
        "GCP Cloud Scheduler",
        "Twilio SendGrid"
      ],
      "links": [
        {
          "label": "View the Components in Storybook.js",
          "url": "https://65d287f2e2f0d9b863b88cfa-tvijbshvmk.chromatic.com/?path=/story/article-article-group--primary"
        },
        {
          "label": "Browse the Github Repo",
          "url": "https://github.com/MisterPea/times-pilot"
        },
        {
          "label": "Visit the Website",
          "url": "https://times-pilot.vercel.app/home"
        }
      ],
      "summaryHeadline": "A More Personalized News Experience",
      "summaryBody": "The.times.pilot looks to improve the news consumption experience by offering a personalized, accessible, and navigable platform that leverages the New York Times Top-Stories API. It addresses the lack of personalization and a one-size-fits-all approach present in the news media, specifically for The New York Times readers.",
      "problemHeadline": "What Was The Problem?",
      "problemBody": "Despite the New York Times's devotion to world-class journalism and forward-looking user experiences, users struggle with the time commitment required to sift through the various sections and placement hierarchies to find stories that match their interests. Additionally, there's an absence of customizability in the daily top-stories emails.",
      "userResearchHeadline": "What Were Users Saying?",
      "userResearchBody": {
        "body": "Users were frustrated with being forced to browse through topics they felt to be overwhelming, and often depressing. This highlighted a desire for a more tailored news/news-email experience. Some specific problems were:",
        "list": [
          "Lack of customization (NY Times doesn't provide a way to have a user organized news homepage).",
          "There is no way to customize the daily top-stories emails.",
          "Exposure to topics ill-fitting to their tastes.",
          "The news is too depressing to look at all the time."
        ]
      },
      "approachSectionTitle": "The Approach",
      "approaches": [
        {
          "headline": "Provide users the means to personalize their daily email",
          "body": "With the subscribe/unsubscribe feature, users are empowered to curate their daily email content based on their interests, moving away from the traditional one-size-fits-all model. This significantly improves user engagement by promoting a more interactive approach to the news."
        },
        {
          "headline": "Enhance Content Accessibility",
          "body": "By shifting from the traditional newspaper hierarchy to a model of content equality, users are impelled to explore a wider range of articles without the bias of page prominence influencing their choices. Recognizing that our perception of the world is influenced by time and sequence, achieving a completely neutral experience may be challenging. However, by equalizing content presentation, significant steps are made towards a more balanced and inclusive user experience."
        },
        {
          "headline": "Bring focus and calm by allowing users to choose what news sections are presented to them",
          "body": "When users are afforded straightforward options to tailor their news intake, we enable them to foster a deeper relationship to the content that interests them—unburdened by content they're not interested in."
        },
        {
          "headline": "Allow easy access to all settings",
          "body": "There shouldn't be extraneous steps when wanting to update news topics, preferences, account info, or access bookmarked stories. Access to all of these settings are reachable through a single button click."
        }
      ],
      "design": {
        "designHeadline": "Design Considerations",
        "designList": [
          "Highly Visible: High contrast ratios and system-relative font sizes are selected to cater to users with suboptimal eyesight, while still maintaining a pleasing aesthetic.",
          "Unencumbered Navigation: Users can navigate around the site without being logged in or having an account, while access to member features remains blocked.",
          "User-Account Autonomy: Users maintain complete control over their accounts, enabling them to modify all informational aspects freely, without any dark patterns.",
          "No Spamming: Only send emails when there is an intersection between the topics the user wishes to see and the top stories of the day."
        ],
        "typeHeadline": "Typefaces",
        "typeSamples": "undefined",
        "colorHeadline": "Colors",
        "colorList": [
          {
            "name": "Darkest",
            "color": "#262626",
            "contrast": 13.51
          },
          {
            "name": "Dark",
            "color": "#3D3D3D",
            "contrast": 9.70
          },
          {
            "name": "Lightest Text",
            "color": "#767676",
            "contrast": 4.54
          },
          {
            "name": "Background",
            "color": "#F3F2EF",
            "contrast": 1.00
          },
          {
            "name": "Green",
            "color": "#368433",
            "contrast": 4.66
          },
          {
            "name": "Warning",
            "color": "#F58F00",
            "contrast": 2.18
          },
          {
            "name": "Error",
            "color": "#DC0105",
            "contrast": 5.18
          },
          {
            "name": "Accent",
            "color": "#CCFF00",
            "contrast": 9.24
          }
        ]
      },
      "siteFlow": {
        "headline": "High-Level Site Flow",
        "body": "It's important that users are able to get a sense of what the site has to offer without going through the signup process. Too often users are forced through a signup funnel only to find out they're not interested in the product. To allow this, the site is set up in a tiered fashion, where an unauthenticated user can still look around, but they will be unable to save articles or subscribe to email topics, as those functions require an email address."
      },
      "problems": {
        "headline": "Problems Met, Issues Solved",
        "body": [
          "Creating article-card interactions that utilize the inherent attributes of the screen; be it mobile or tablet/desktop.",
          "When displaying article-cards on a tablet or desktop environment there are occasions where we have a full row preceding a row with one article—and the remaining space is empty and unutilized. This was a hamper on usability and aesthetics, and needed to be rectified.",
          "Developing a new account sign-up flow that expeditiously guides the user through the several steps of account creation—while also being tolerant to stalled signups and premature exits from the sign-up flow."
        ],
        "problemOne": {
          "headline": "Desktop Article Card versus Mobile Article Card",
          "body": "Because interaction with mobile is done with fingers (not a pointer) and space is at a premium, the mobile implementation of bookmarks uses modified placement of the bookmark flag, and a slide-to-reveal interaction. A common and, now, natural interaction on mobile devices."
        },
        "problemTwo": {
          "headline": "Optimizing Article Layout",
          "body": "When organizing article summaries, efforts were made to create a consistent, unbiased format. This included addressing layout gaps caused by too few articles to fill the space. This was solved by calculating headline and description lengths, which allowed the prioritization of the five longest summaries to fill any excess space. This enhanced the visual appeal and readability, thereby engaging users more effectively."
        },
        "problemThree": {
          "headline": "New User Signup Flow",
          "body": "Once a user enters a username, email, and password—they will have an account; whether or not they go through each signup step or if they get to the end of the flow.",
          "imageCaption": [
            {
              "headline": "User enters their username, email, and password.",
              "body": "Contact database and check that email isn't in use. If it's a new email, we create a unique uid (user id) within the auth database. We then allocate space within the NoSQL database for the new user under their uid."
            },
            {
              "headline": "User chooses which sections are exposed to them.",
              "body": "If we exit from this point, the user will have default settings applied."
            },
            {
              "headline": "Further personalize with an avatar.",
              "body": "To allow for a personal experience we can accept an avatar."
            },
            {
              "headline": "Signup completed.",
              "body": "If they get to the end, the user is shown a confirmation of account creation."
            }
          ]
        }
      }
    }
  },
  {
    "slug": "circuit-app",
    "isProject": false,
    "projectHeadline": "Circuit: Revolutionizing Time Management for Creatives",
    "description": "An iOS app to empower creative minds by bettering focus and eliminating burnout.",
    "landingToolList": [
      "Figma",
      "Photoshop"
    ],
    "projectPage": {
      "headlineOne": "Circuit App",
      "headlineTwo": "Revolutionizing Time Management for Creatives",
      "role": "Concept, Design",
      "tools": [
        "Figma",
        "Photoshop"
      ],
      "links": [
        {
          "label": "Figma Prototype",
          "url": "https://www.figma.com/proto/qbEmJWDw0g55I12bji05AB/Circuit-revisit?type=design&node-id=104-257&t=d5oqzpqqskE6aos1-1&scaling=min-zoom&page-id=86%3A194&starting-point-node-id=90%3A206&show-proto-sidebar=1&mode=design"
        },
        {
          "label": "Figma Layout",
          "url": "https://www.figma.com/file/qbEmJWDw0g55I12bji05AB/Circuit-revisit?type=design&node-id=86%3A194&mode=design&t=vRf3qiONLpSwo8ba-1"
        }
      ],
      "summaryHeadline": "Making Time To Make Time",
      "summaryBody": "Circuit App is designed to address the unique time management challenges faced by creative professionals. It offers users a way to deal with the contradictory issues of distraction mitigation and preventing burnout from overworking. By structuring time into focused work periods and restful breaks, Circuit App aims to enhance productivity and creativity, while reducing stress and mental exhaustion.",
      "problemHeadline": "How Did We Get Here?",
      "problemBody": "Creative professionals (and the larger public in general) are often grappling with contrasting challenges: the lure of distractions, including social media and meetings, and a tendency to work for extended periods without breaks, leading to mental fatigue. Maintaining a balance is a crucial aspect in avoiding burnout and general well-being.",
      "userResearchHeadline": "The Gravity That Captures Us All",
      "userResearchBody": "Time management exerts enormous gravity in the life of a creative. It has a significant impact on the productivity and stress levels of creatives, and is a constant source of tension. At some point  creatives have struggled with balancing project deadlines, learning new technologies, and managing the distractions of working in a tightly-woven digital environment. The need for a solution that helps navigate these challenges efficiently is evident.",
      "approachSectionTitle": "The Proposition",
      "approaches": [
        {
          "headline": "Easy Selection, Easy Modification",
          "body": "Eliminate visual clutter to facilitate quick program selections and straightforward modifications. Prioritize legibility and accessibility of essential information for quick scanning."
        },
        {
          "headline": "Custom Circuit Creation",
          "body": "Creating a bespoke program (Circuit) is simple: pick a title, define the active/rest durations and the repetition count—that’s it. A total duration (active + rest, multiplied by repeats) is shown at the base of the input area, providing users with the total time commitment."
        },
        {
          "headline": "Intuitive Feedback",
          "body": "With a matrix of circles we are able to visually represent time as discrete visual elements. In one glance the user is able to see roughly how far along they are in the current timer/period. This matrix configuration also allows the user to have a timing scheme for up to 8 hours, which is the current limit of Apple's Live Activities for iOS."
        }
      ],
      "design": {
        "designHeadline": "Design Considerations",
        "designList": [
          "Intuitive User Interface: As a productivity app, it should offer easy interaction at a glance, requiring minimal mental effort from users with fleeting focus.",
          "Smart Presets: Options are provided pre-configured for easy, out-of-the-box operation.",
          "Progress Tracking: To help track work patterns and progress, the system will give the user access to a record of their progress.",
          "Native API: Utilize Apple iOS 16+ LiveActivities to offer users live feedback, minimizing the need to pick up and open their devices."
        ],
        "typeHeadline": "Typefaces",
        "typeSamples": "undefined",
        "colorHeadline": "Colors",
        "colorList": [
          {
            "name": "Warm Black",
            "color": "#2d2c2c"
          },
          {
            "name": "Text Light",
            "color": "#6f766f"
          },
          {
            "name": "Warm White",
            "color": "#fbf8f3"
          },
          {
            "name": "Rest Blue",
            "color": "#32ade6"
          },
          {
            "name": "Go Green",
            "color": "#34c759"
          },
          {
            "name": "Error Red",
            "color": "#ff3b30"
          },
          {
            "name": "Warn Orange",
            "color": "#ff9500"
          }
        ]
      },
      "siteFlow": {
        "headline": "Potential App Structure",
        "body": "The app is divided into 3 screens and 1 large-detent sheet. User data can be stored within the device's persistent storage which would allow transferring or offloading of data to different devices. This app should also make use of Apple’s Live Activities for iOS. This would allow the user to view progress from their iPhone lock-screen without explicitly opening the Circuit app."
      }
    }
  },
  {
    "slug": "made-with-d3",
    "isProject": true,
    "projectHeadline": "Made With D3.js: From Numbers to Narratives",
    "description": "Exploring datasets with JavaScript and D3.js visualizations.",
    "landingToolList": [
      "D3.js",
      "TypeScript",
      "React"
    ],
    "projectPage": {
      "headlineOne": "Made With D3.js",
      "headlineTwo": "From Numbers to Narratives",
      "role": "Concept, Design, Development",
      "summaryHeadline": "Making the Invisible, Visible",
      "summaryBody": "These projects showcase another tool for storytelling: D3.js. D3.js streamlines the process of transforming large, complex datasets into intelligible, graphical charts. This allows us to convert previously cryptic information into forms that are readily understandable for users.",
      "tools": [
        "D3.js",
        "TypeScript",
        "React"
      ],
      "links": [
        {
          "label": "Browse the Github Repo",
          "url": "#"
        }
      ]
    }
  }
]